import React from "react";
import { Card, Col, Container, Image, Row } from "react-bootstrap";

import '../styles/contacts.scss';
import AboutImg from '../images/about.png';

const Contacs = () => {
    return (
        <div id="contacts">
            <Container>
                <div className="top">
                    <h1>Қысқаша біз туралы</h1>
                    <Row>
                        <Col xs={12} md={6} className="col">
                            <div className="content">
                                <h4>ЖанАшыр- жаңа платформасы</h4>
                                <p>Жас мамандармен қосылып ашқан жаңа стартапымыз. Осы платформа арқылы Қазақстанның барлық көмек қорларын көріп, толығырақ сол туралы ақпарат ала-аласыз. Көмек ретінде өзіңіздің жеке парақшаңыз арқылы қаржылай көмек беруіңізге болады. </p>
                            </div>
                        </Col>
                        <Col xs={6} className="d-none d-md-block col">
                            <Image src={AboutImg} />
                        </Col>
                    </Row>
                </div>
            </Container>
            <Container className="main-content">
                <div className="bg-white">
                    <div className="content">
                        <h4 className="text-center">Біздің Қордың миссиясы - Қазақстандағы қайырымдылықты жүйелі дамыту және қоғамның әлеуметтік мәселелерді шешуге деген көзқарасын өзгерту болып табылады.</h4>
                        <h2>Біз кімге көмектесеміз?</h2>
                        <p><strong>"ЖанАшыр"</strong> - бұл "қорлар қоры". Біз адамдарды тарта отырып, әлеуметтік мәселелерді шешуге жағдай жасай отырып және еліміздегі әлеуметтік бастамаларды қолдай отырып, Ресейдегі қайырымдылық секторы мен азаматтық қоғамды дамыту бойынша жұмыс істеп жатырмыз.</p> 
                        
                        <h2>Біздің міндетіміз</h2>
                        <p>Қазақстандағы көптеген әлеуметтік проблемалар бар, оларды шешу үшін көптеген қайырымдылық, еріктілер ұйымдары мен бастамалар қажет. Мұндай ұйымдар әр облыста, әр қалада, әр ауданда болуы керек. Олар жақсы жұмыс істеуі керек, кәсіби көмек көрсетуі керек. Оларды қолдау және күшейту-біздің басты міндетіміз.</p>
                        <p>Бірақ қайырымдылық секторын дамыту қоғам үшін ғана емес, мемлекеттік билік органдары үшін де маңызды. Өйткені, әлеуметтік мәселелерді шешудегі қайырымдылық ұйымдарының рөлі неғұрлым жоғары болса, адамдардың қатысу деңгейі соғұрлым жоғары болады, биліктің бұл проблемаларға көбірек көңіл бөлуі. Қайырымдылық ұйымдарының жұмысының арқасында қоғамдық диалог пайда болады және мемлекеттік жүйе әлеуметтік мәселелерді шешуде тиімді жұмыс істей бастайды, біздің салықтар сіздермен тиімді бөлінеді.</p>
                        <p>Бүгінгі таңда "ЖанАшыр" қоры — бұл бірін-бірі толықтыратын өнімдер мен сервистердің нағыз экожүйесі. Олардың барлығы қайырымдылық секторын дамытуға және қоғамның әлеуметтік мәселелерді шешуге деген көзқарасын өзгертуге бағытталған.</p>
                        
                        <h2>Сараптамалық бағалау</h2>
                        <p>Кез келген коммерциялық емес ұйымның қызметі заңды және ашық болуға тиіс. Біздің сайтта құрбан бола отырып, сіздің ақшаңыз бенефициарларға жететініне және алаяқтардың қолына түспейтініне сенімді бола аласыз. Біздің каталогтағы барлық қорлар сараптамалық бағалаудан өтеді. Біз осы ұйымдардың барлық құжаттары мен есептілігін тексеріп қана қоймай, олардың әрқайсысының беделіне баға береміз.</p>
                    </div>
                </div>

                <div id="contact-list">
                    <h1>Бізбен байланыс</h1>
                    <p>
                        Телефон нөміріміз: <a href="tel:8 776 496 05 19">8 776 496 05 19</a>
                    </p>
                    <p>
                        Электронды почтамыз:  <a href="mailto:zhanashyrcompany@gmail.com">zhanashyrcompany@gmail.com</a>
                    </p>
                    <p>
                        Мекен-жайымыз: <a className="addr">Алматы обылысы , Каскелен ауданы , СДУ</a>
                    </p>
                </div>
            </Container>
            
            <div className="map">
                <div className="content">
                    <div className="left">
                        <Card>
                            <Card.Body>
                                <Card.Title>АДРЕС</Card.Title>
                                <Card.Text>
                                    <strong>Благотворительный фонд «ЖанАшыр»</strong>
                                    <br />
                                    <br />
                                    Каскелен, Карасайский район, Алматинская область, Казахстан,проспект Абылай Хана, 1/1
                                    <br />
                                    <br />
                                    8 776 496 05 19
                                </Card.Text>
                            </Card.Body>
                        </Card>
                    </div>
                </div>
                <iframe id="map" src="https://yandex.ru/map-widget/v1/?um=constructor%3A7ace0817bebd6f82c6682474f505ebb3a8da64f19ce19cc48dcdd8d8cd38e716&amp;source=constructor" width="1280" height="720" frameBorder="0"></iframe>
            </div>
        </div>
    );
};

export default Contacs;